lab_meetings/journalclub2020sept/NOTES.org
#+OPTIONS: H:2 toc:nil
#+LATEX_CLASS: beamer
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+BEAMER_THEME: UoB


* Background / intro
** NOTE
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Numerical continuation is a useful tool for deterministic systems
     * It allows us to see how equilibria and limit cycles change when we change a parameter
\vfill
   * Stochastic dynamics can't be studied with standard continuation
     * Standard methods can't track randomness
\vfill
   * This work tries to change that
     * 10s summary of the method:
     * Compute a covariance matrix around the deterministic equilibria
     * Use that to define an ellipsoid within which the sample paths probably lie
     * Track those ellipsoids over parameter changes

* Section 1
** NOTES Chapter 1: Intro
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Deterministic systems
    * Determinisim means no noise or randomness; if we know the state now, and the equations, we know it forever more
    * Equilibrium = time-invariant solution
      * Which means that its some state that if the system starts there, it'll stay there
      * A hanging pendulum, where it lies balanced pointing downwards
      * The same but unbalanced, pointing upwards; as long as it's not perturbed, it'll balance there forever
      * Examples include a chemical equilibrium, where forward and backward reactions balance, to give a constant amount of reactant and product
    * Equilibrium state depends on parameters
      * For example, in a chemical system, adding more heat might shift the balance from lots of reactant / little product to lots of product / little reactant
    * Continuation reveals that dependence
      * It shows us where equilibria move to, as parameters change
      * Lets us compute curves showing where in state space an equilibrium will lie, for some given parameter value

** NOTES From deterministic to stochastic
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Very little work to extend continuation to SDEs
     * Most research is on simulation and integration
     * Some methods for tracking invariant measures
     * Moment map method, where statistics of the system (eg. mean state vector, variance) are tracked
\vfill
   * How does small noise change deterministic results?
     * Say we have a deterministic system; it's easy to perform a continuation analysis
     * This reveals stable, unstable equilibria, limit cycles, etc.
     * How does the stability of these sets change when we add a small amount of randomness into the system?
     * Stable equilibria may become `metastable'; solutions tend to remain close to the equilibrium, but noise-induced transitions may occur between the different stable states in the system
\vfill
   * We can extend numerical continuation to track local information about metastable equilibria
     * The resulting algo can be applied either during continuation, or as a post-processing tool after a determnistic continuation has been performed
     * The paper proposes that it can extend further to nonstationary solutions, stochastic PDEs, stochastic DDEs; later papers actually do this [I THINK?]

* Section 2
** NOTES Section 2: an analytical example
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Consider a noise-corrupted pitchfork normal form
     * A pitchfork bifurcation is where a single stable equilibrium splits into two stable equilibria; a third, unstable equilibrium then appears between them
     * Details aren't particularly important, but basically it's one way for a system to transition from monostability to bistability
     * The system acts like a ball in a double potential well; if the ball is the system state, it'll roll down into one of two potential wells and stay in the bottom, when no noise is present
     * To noise-corrupt it, we add a little bit of randomness into the vector field; the system is then given by the deterministic component which does most of the work to evolve the system state, plus some random component that'll make the state jump around a little
     * The resulting bistability is similar to eg. climate dynamics: iceball-earth is a stable state, whereby earth temperature is kept low by ice caps reflecting radiation back to space; hot earth is also a stable state, whereby no ice caps mean less reflection meaning hot earth; randomness comes from volcanoes, forest fires, etc

** Noise-induced pitchfork dynamics
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Interesting noise-induced dynamics occur in the bistable region
     * The randomness gives the ball a chance to jump out of one potential well and into the other, when the random nudges all add up in such a way as to push it up and over the unstable state
     * This gives rise to lots of interesting effects such as coherence resonance, where adding more noise into a neruonal system can make it more orderly and well-behaved; or stochastic resonance, where adding noise into a neuronal system can make it more sensitive to some input signal

\vfill
   * For any initial condition, we will almost surely visit visit both potential wells in finite time
     * Let's start the system at some arbitrary initial conditions
     * Let's fix the \(\mu\) at some point that ensures bistability
     * Let's fix the noise amount at any non-zero amount (ie. at least some noise)
     * Even with huge distances between the potential wells, starting somewhere way away from either well, and tiny noise applied, with probability 1 the ball will visit the bottom of both potential wells within finite time

\vfill
   * We seek a stronger result; what insights can we gain into the timescales of the stochastic transitions?
     * Stochastic transition is just the jump from one potential well to the other
     * Intuitively, this will take a long time with small noise and deep potential wells, and be very fast with large noise and shallow potential wells
     * Arrhenius' law gives us the order of the switching time as a function of the noise intensity and the potential well sizes
     * Potential well sizes in turn are dictated by the bifurcation parameter \(\mu\), so Arrhenius' law for this system relates the timescale of stochastic transitions to the bifurcation parameter and noise intensity

