lab_meetings/journalclub2020sept/NOTES.tex
% Created 2020-09-29 Tue 15:16
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{UoB}
\author{mark}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={mark},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}



\section{Background / intro}
\label{sec:orgf3b5278}
\begin{frame}[label={sec:org391c4b6},plain]{NOTE}
\begin{itemize}
\item Numerical continuation is a useful tool for deterministic systems
\begin{itemize}
\item It allows us to see how equilibria and limit cycles change when we change a parameter
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Stochastic dynamics can't be studied with standard continuation
\begin{itemize}
\item Standard methods can't track randomness
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item This work tries to change that
\begin{itemize}
\item 10s summary of the method:
\item Compute a covariance matrix around the deterministic equilibria
\item Use that to define an ellipsoid within which the sample paths probably lie
\item Track those ellipsoids over parameter changes
\end{itemize}
\end{itemize}
\end{frame}

\section{Section 1}
\label{sec:orgcda69ee}
\begin{frame}[label={sec:org63ac88a},plain]{NOTES Chapter 1: Intro}
Deterministic systems
\begin{itemize}
\item Determinisim means no noise or randomness; if we know the state now, and the equations, we know it forever more
\item Equilibrium = time-invariant solution
\begin{itemize}
\item Which means that its some state that if the system starts there, it'll stay there
\item A hanging pendulum, where it lies balanced pointing downwards
\item The same but unbalanced, pointing upwards; as long as it's not perturbed, it'll balance there forever
\item Examples include a chemical equilibrium, where forward and backward reactions balance, to give a constant amount of reactant and product
\end{itemize}
\item Equilibrium state depends on parameters
\begin{itemize}
\item For example, in a chemical system, adding more heat might shift the balance from lots of reactant / little product to lots of product / little reactant
\end{itemize}
\item Continuation reveals that dependence
\begin{itemize}
\item It shows us where equilibria move to, as parameters change
\item Lets us compute curves showing where in state space an equilibrium will lie, for some given parameter value
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org2ebac0e},plain]{NOTES From deterministic to stochastic}
\begin{itemize}
\item Very little work to extend continuation to SDEs
\begin{itemize}
\item Most research is on simulation and integration
\item Some methods for tracking invariant measures
\item Moment map method, where statistics of the system (eg. mean state vector, variance) are tracked
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item How does small noise change deterministic results?
\begin{itemize}
\item Say we have a deterministic system; it's easy to perform a continuation analysis
\item This reveals stable, unstable equilibria, limit cycles, etc.
\item How does the stability of these sets change when we add a small amount of randomness into the system?
\item Stable equilibria may become `metastable'; solutions tend to remain close to the equilibrium, but noise-induced transitions may occur between the different stable states in the system
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item We can extend numerical continuation to track local information about metastable equilibria
\begin{itemize}
\item The resulting algo can be applied either during continuation, or as a post-processing tool after a determnistic continuation has been performed
\item The paper proposes that it can extend further to nonstationary solutions, stochastic PDEs, stochastic DDEs; later papers actually do this [I THINK?]
\end{itemize}
\end{itemize}
\end{frame}

\section{Section 2}
\label{sec:orgc477e3e}
\begin{frame}[label={sec:orgf723e31},plain]{NOTES Section 2: an analytical example}
\begin{itemize}
\item Consider a noise-corrupted pitchfork normal form
\begin{itemize}
\item A pitchfork bifurcation is where a single stable equilibrium splits into two stable equilibria; a third, unstable equilibrium then appears between them
\item Details aren't particularly important, but basically it's one way for a system to transition from monostability to bistability
\item The system acts like a ball in a double potential well; if the ball is the system state, it'll roll down into one of two potential wells and stay in the bottom, when no noise is present
\item To noise-corrupt it, we add a little bit of randomness into the vector field; the system is then given by the deterministic component which does most of the work to evolve the system state, plus some random component that'll make the state jump around a little
\item The resulting bistability is similar to eg. climate dynamics: iceball-earth is a stable state, whereby earth temperature is kept low by ice caps reflecting radiation back to space; hot earth is also a stable state, whereby no ice caps mean less reflection meaning hot earth; randomness comes from volcanoes, forest fires, etc
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org8354da9},plain]{Noise-induced pitchfork dynamics}
\begin{itemize}
\item Interesting noise-induced dynamics occur in the bistable region
\begin{itemize}
\item The randomness gives the ball a chance to jump out of one potential well and into the other, when the random nudges all add up in such a way as to push it up and over the unstable state
\item This gives rise to lots of interesting effects such as coherence resonance, where adding more noise into a neruonal system can make it more orderly and well-behaved; or stochastic resonance, where adding noise into a neuronal system can make it more sensitive to some input signal
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item For any initial condition, we will almost surely visit visit both potential wells in finite time
\begin{itemize}
\item Let's start the system at some arbitrary initial conditions
\item Let's fix the \(\mu\) at some point that ensures bistability
\item Let's fix the noise amount at any non-zero amount (ie. at least some noise)
\item Even with huge distances between the potential wells, starting somewhere way away from either well, and tiny noise applied, with probability 1 the ball will visit the bottom of both potential wells within finite time
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item We seek a stronger result; what insights can we gain into the timescales of the stochastic transitions?
\begin{itemize}
\item Stochastic transition is just the jump from one potential well to the other
\item Intuitively, this will take a long time with small noise and deep potential wells, and be very fast with large noise and shallow potential wells
\item Arrhenius' law gives us the order of the switching time as a function of the noise intensity and the potential well sizes
\item Potential well sizes in turn are dictated by the bifurcation parameter \(\mu\), so Arrhenius' law for this system relates the timescale of stochastic transitions to the bifurcation parameter and noise intensity
\end{itemize}
\end{itemize}
\end{frame}
