lab_meetings/journalclub2020sept/NOTES.org
** A graphic example
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

   * The top of the figure is the same deterministic bifurcation diagram as we saw before
   * At the bottom, we have example time series
   * The red lines show the locations of the equilibria of the deterministic system; black lines show how the system behaves in time
   * For small \(\mu\), the ball jumps very frequently between the potential wells; transition timescale is small
   * For medium \(\mu\), the ball jumps occasionally between potential wells; transition timescale is medium
   * For large \(\mu\), no jumps are seen over the 1000 units of simulation time
   * We can see from the time series that the system seems to cluster around the deterministic equilibria
   * There's a region of high trajectory density
   * In the fast-transitions case the high-density region is still there, but the regions for the top and bottom metastables actually overlap
   * Interesting idea: define some notion of high-density region, and use the distances between them as a proxy for the transition timescale
   * High-density regions are shown in blue and green on the top plot
   * They move further appart as the bifurcation parameter increases
   * In the first case, they are seen to overlap, which explains why the system jumps between the two states so rapidly; in the last case, there is a large separation between the two, which explains why the system never jumps between metastables

** Studying stochastic transitions
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * What methods can we use to study the high-density regions?
     * We need a way of defining them mathematically, before we can hope to study their parameter dependence
\vfill
   * Fokker-Planck equations are inefficient
     * Builds a probability density function for the system state, for all time
     * It can be used to describe the probability of the system being at some point x, at some time t, for some initial conditions
     * Inefficient!
     * This essentially solves the stochastic differential equation at every point in phase space, which may be computationally inefficient when we're only interested in the local metastability of equilibria
\vfill
   * can we find a more efficient way of defining them?
     * With small noise intensities, the stochastic dynamics are very similar to their deterministic equivalent, over small timescales
     * We have efficient methods for studying deterministic systems, so can we repurpose those to the small-noise case?
     * If we can, we can come up with some nice elegant efficient algorithms for continuing the high-density regions

** Continuation of metastable equilibria
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Can we find a more efficient way of defining high-density regions?
\vfill
   * Linearise the system about each equilibrium point
     * Assume that the system lies close to one of the deterministic equilibria
     * Replace the deterministic component of the system with a linear approximation
     * This gives us an Ornstein-Uhlenbeck process, for which we can calculate the variance
\vfill
   * Calculate the variance of the resulting stochastic process
     * We can do this analytically, since we've linearised the original system
     * This gives us a simple formula for the variance of the system state around the equilibrium we linearised around
\vfill
   * Choose a ball around the deterministic equilibria, such that sample paths stay within it with high probability
     * The variance lets us determine how big this ball should be
     * That's much like confidence intervals, where we specify confidence in terms of standard deviations from the mean; data are fairly likely to be within 1 sigma, more likely to be within 2 sigma, etc.
     * Defining the ball size in terms of some variance multiplier (confidence level) therefore makes the `dense region' definition consistent across processes, and interpretable though its conventional statistical analogs
** Towards a stochastic continuation algorithm
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
We need three results to be able to use this definition in continuation
\vfill
   * Generalise variance ball construction to arbitrary-dimensional SDEs
     * Take our definition of a variance ball from before, and extend it away from the 1d case, towards something we can use for SDEs of any dimension
     * This forms section 3 of the work
\vfill
   * Efficiently compute the covariance matrix of the linearised SDE, at each point on the continuation curve
     * Need to find a way to exploit whatever information is already available from the continuation procedure
     * Forms section 4 of the work

\vfill
   * Define test-functions for overlapping stochastic neighbourhoods
     * Define some way of testing whether any given pair of `high-density / high-confidence' neighbourhood balls overlap
     * Covered in section 5

* Section 3
** Section 3: metastability and linearization
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

   * We can linearise multidimensional processes easily
     * This just extends the 1-d case to processes with multiple state variables
     * Transform the variables so that the deterministic equilibrium is at the origin
     * Taylor-expand around the origin
     * Throw away the higher-order terms
     * We're then left with a multi-dimensional Ornstein-Uhlenbeck process

\vfill
   * The covariance matrix is then given by the solution to an ODE
     * I've skipped the full derivation because it's not very useful to anyone
     * Essentially we repeat the moments derivation from the one-dimensional case, but instead use a Jacobian matrix where previously we used scalar gadients
     * This would give us an integral equation, which we then differentiate to get an ODE for the covariance
     * The time-invariant solution of this ODE is the covariance matrix of the linearised SDE

\vfill
   * The time-invariant solution is a solution of a Lyapunov equation
     * As the equilibrium we linearised around is necessarily stable, the Lyapunov equation is guaranteed to be solvable
\vfill
   * Ellipsoids are defined with their principle axes scaled according to the inverse covariance matrix
     * As with the 1d case, sample paths will exist within these ellipsoids with high probability, making them `trajectory-dense' regions
     * The covariance matrix therefore exists, and allows us to define `ellipsoids' as a generalisation of the variance balls, whereby principal axes are scaled according to the inverse covariances
     * The inverse is not guaranteed to exist, however the controllability theorem allows us to link the structure of the noise to whether or not the inverse exists
* Section 4
