lab_meetings/journalclub2020sept/NOTES.tex

\begin{frame}[label={sec:org8ae4a6b},plain]{A graphic example}
\begin{itemize}
\item The top of the figure is the same deterministic bifurcation diagram as we saw before
\item At the bottom, we have example time series
\item The red lines show the locations of the equilibria of the deterministic system; black lines show how the system behaves in time
\item For small \(\mu\), the ball jumps very frequently between the potential wells; transition timescale is small
\item For medium \(\mu\), the ball jumps occasionally between potential wells; transition timescale is medium
\item For large \(\mu\), no jumps are seen over the 1000 units of simulation time
\item We can see from the time series that the system seems to cluster around the deterministic equilibria
\item There's a region of high trajectory density
\item In the fast-transitions case the high-density region is still there, but the regions for the top and bottom metastables actually overlap
\item Interesting idea: define some notion of high-density region, and use the distances between them as a proxy for the transition timescale
\item High-density regions are shown in blue and green on the top plot
\item They move further appart as the bifurcation parameter increases
\item In the first case, they are seen to overlap, which explains why the system jumps between the two states so rapidly; in the last case, there is a large separation between the two, which explains why the system never jumps between metastables
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org33a63cd},plain]{Studying stochastic transitions}
\begin{itemize}
\item What methods can we use to study the high-density regions?
\begin{itemize}
\item We need a way of defining them mathematically, before we can hope to study their parameter dependence
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Fokker-Planck equations are inefficient
\begin{itemize}
\item Builds a probability density function for the system state, for all time
\item It can be used to describe the probability of the system being at some point x, at some time t, for some initial conditions
\item Inefficient!
\item This essentially solves the stochastic differential equation at every point in phase space, which may be computationally inefficient when we're only interested in the local metastability of equilibria
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item can we find a more efficient way of defining them?
\begin{itemize}
\item With small noise intensities, the stochastic dynamics are very similar to their deterministic equivalent, over small timescales
\item We have efficient methods for studying deterministic systems, so can we repurpose those to the small-noise case?
\item If we can, we can come up with some nice elegant efficient algorithms for continuing the high-density regions
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org8556021},plain]{Continuation of metastable equilibria}
Can we find a more efficient way of defining high-density regions?
\vfill
\begin{itemize}
\item Linearise the system about each equilibrium point
\begin{itemize}
\item Assume that the system lies close to one of the deterministic equilibria
\item Replace the deterministic component of the system with a linear approximation
\item This gives us an Ornstein-Uhlenbeck process, for which we can calculate the variance
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Calculate the variance of the resulting stochastic process
\begin{itemize}
\item We can do this analytically, since we've linearised the original system
\item This gives us a simple formula for the variance of the system state around the equilibrium we linearised around
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Choose a ball around the deterministic equilibria, such that sample paths stay within it with high probability
\begin{itemize}
\item The variance lets us determine how big this ball should be
\item That's much like confidence intervals, where we specify confidence in terms of standard deviations from the mean; data are fairly likely to be within 1 sigma, more likely to be within 2 sigma, etc.
\item Defining the ball size in terms of some variance multiplier (confidence level) therefore makes the `dense region' definition consistent across processes, and interpretable though its conventional statistical analogs
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgf16617f},plain]{Towards a stochastic continuation algorithm}
We need three results to be able to use this definition in continuation
\vfill
\begin{itemize}
\item Generalise variance ball construction to arbitrary-dimensional SDEs
\begin{itemize}
\item Take our definition of a variance ball from before, and extend it away from the 1d case, towards something we can use for SDEs of any dimension
\item This forms section 3 of the work
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Efficiently compute the covariance matrix of the linearised SDE, at each point on the continuation curve
\begin{itemize}
\item Need to find a way to exploit whatever information is already available from the continuation procedure
\item Forms section 4 of the work
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item Define test-functions for overlapping stochastic neighbourhoods
\begin{itemize}
\item Define some way of testing whether any given pair of `high-density / high-confidence' neighbourhood balls overlap
\item Covered in section 5
\end{itemize}
\end{itemize}
\end{frame}

\section{Section 3}
\label{sec:org439926d}
\begin{frame}[label={sec:org4e7cb73},plain]{Section 3: metastability and linearization}
\begin{itemize}
\item We can linearise multidimensional processes easily
\begin{itemize}
\item This just extends the 1-d case to processes with multiple state variables
\item Transform the variables so that the deterministic equilibrium is at the origin
\item Taylor-expand around the origin
\item Throw away the higher-order terms
\item We're then left with a multi-dimensional Ornstein-Uhlenbeck process
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item The covariance matrix is then given by the solution to an ODE
\begin{itemize}
\item I've skipped the full derivation because it's not very useful to anyone
\item Essentially we repeat the moments derivation from the one-dimensional case, but instead use a Jacobian matrix where previously we used scalar gadients
\item This would give us an integral equation, which we then differentiate to get an ODE for the covariance
\item The time-invariant solution of this ODE is the covariance matrix of the linearised SDE
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item The time-invariant solution is a solution of a Lyapunov equation
\begin{itemize}
\item As the equilibrium we linearised around is necessarily stable, the Lyapunov equation is guaranteed to be solvable
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Ellipsoids are defined with their principle axes scaled according to the inverse covariance matrix
\begin{itemize}
\item As with the 1d case, sample paths will exist within these ellipsoids with high probability, making them `trajectory-dense' regions
\item The covariance matrix therefore exists, and allows us to define `ellipsoids' as a generalisation of the variance balls, whereby principal axes are scaled according to the inverse covariances
\item The inverse is not guaranteed to exist, however the controllability theorem allows us to link the structure of the noise to whether or not the inverse exists
\end{itemize}
\end{itemize}
\end{frame}
