lab_meetings/journalclub2020sept/NOTES.org
** Section 4: The Lyapunov equation
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
We have established the covariance matrix is given by the solution to a Lyapunov equation. How do we solve it for a single equilibrium? And for a branch of equilibria?

    * Solution methods are well-studied within control theory
      * We can re-write the Lyapunov equation into a simple linear system of form Ax=b, and guarantee A is invertible
      * This means the system is definitely solvable, but perhaps there's a more computationally efficient way of approaching this than entirely restructuring the equation

\vfill
    * The continuation consideration adds several new aspects to the problem
      * We have access to the deterministic system Jacobian, as a result of the predictor-corrector steps of the continuation algorithm; this gives us one of the two necessary matrices
      * The other matrix can be found using at most one matrix multiplication; for additive noise, it can be precomputed without any preexisting knowledge
      * Since we're using the solution within parameter continuation, the covariance matrix at one parameter value is an excellent guess for the covariance matrix at another nearby parameter value. As such, we have excellent initial guesses for any iterative methods

\vfill
   * Covariance computation is actually fairly straightforward, with several methods available
     * A good initial choice means iterative methods are an obvious choice
     * Gauss-Seidel algo is a good choice, for when the system is cast into Ax=b form
     * Smith's algorithm gives us an iterative method to solve the original Lyapunov equation, without having to restructure it into Ax=b form, but does not use the initial guess, so it might be slower
     * There's also a direct method -- the Bartels-Stewart algo -- for solving the Lyapunov equation without iterations; this is useful to get the solution at the first continuation point, which can then be used as the initial guess for subsequent iterations
     * Section 7 compares the algos; the iteration is fastest for weak to medium convergence tolerances
       
** Noise structure and degenerate ellipsoids
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * If the covariance matrix is noninvertible, we can't define ellipsoids
\vfill
   * This can happen for certain system and noise structures
     * Say we have an uncoupled linearisation; each state variable evolves independently of the others, in the linearisation
     * If noise only acts on some state variables, there'll be some evolving stochastically, and some deterministically
     * In this case, the ellipsoid becomes ill-defined
\vfill
   * Define density neighbourhood over the stochastic variables only
     * Replace deterministic variables with their equilibrium value
     * Place the standard ellipsoid ball over the stochastic subset
     * Ellipsoid becomes well-defined again
* Section 5
** Problem 3: Ellipsoids and test functions
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Distance between two ellipsoids indicates the timescale of their stochastic transitions; how do we compute it?
     * It's a useful problem in robotics, satellite control, computational geometry, etc.
     * Lots of different methods have been proposed as a result
\vfill
   * We choose a distance measure that doubles up as a test function
     * Test functions are just some equation that we plug data into, and it interprets the data for us
     * If the distance measure is >0, the ellipsoids are disjoint
     * Distance measure = 0 means ellipsoids just touch, at a point
     * Distance measure <0 means ellipsoids intersect
     * This allows us to test for dynamical switching at some timescale
\vfill
   * The distance is given by the solution to an optimization problem
     * I don't particularly understand the optimization step
     * Efficient algorithms are (apparently) available to solve it, and the paper outlines the key equations required to use them
     * As previously, we can use the previous step's solution as a good initial guess for the optimization procedure
* Section 6
** Algorithm summary
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Initialization step; for each equilibrium...
\vfill
   * Find a stable equilibrium of the deterministic component of the system
     * This is a standard problem. Could either solve though integration, or Newton's method
\vfill
   * Compute the linearisation of the deterministic system at that equilibrium
     * Basically just change the variables so that the equilibrium is at the origin, then take the Jacobian
\vfill
   * Set up the Lyapunov equation for covariances, and solve using Bartels-Stewart algorithm
     * This is the algo of choice as it doesn't require any initial guess

     
\vfill
This gives us both an equilibrium to start the continuation from, and a covariance matrix which we can then re-use as an initial guess for subsequent solvings of the Lyapunov equation

The next step is to continue the equilibrium and covariance matrix under changes in a parameter

** Algorithm summary
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Iteratively...
   * Take a predictor-corrector step, solving deterministic continuation equations at a new parameter value
     * This is the same as with standard continuation; predict the next solution value (equilibrium point + regularisation terms), then refine the prediction using root finding methods
\vfill
   * Iteratively solve the Lyapunov equation
     * Construct the Lyapunov equation for the current covariance matrix
     * Use the previous solution as an initial guess
     * Solve it iteratively, to get the current linearised covariance
\vfill
   * Construct a high-density ball, for some chosen confidence level
     * An ellipsoid whose shape is given by the covariance matrix, and size is given by the confidence level; will be smaller in directions with lower variance, larger in directions with higher variance
\vfill
   * Solve an optimization problem for the distances between each pair of balls
     * Use the distance between balls at the previous step as the initial guess for the current step
   
** Outputs
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Deterministic equilibria
     * These are the standard equilibria that the system would settle to, if it weren't for random effects
     * Obtained by applying standard numerical continuation algorithms to the deterministic component
\vfill
   * Ellipsoids
     * These are the confidence balls around each equilibrium
     * They show where the sample path will very probably lie
     * They're basically the stochastic version of an equilibrium
\vfill
   * Mutual distances
     * The distance between pairs of ellipsoids
     * These give an estimate of the rate of stochastic transition between pairs of metastable equilibria
     * Big distances mean transitions are rare
     * Small distances mean transitions are more frequent
     * Zero or negative distance means transitions are very common
       
* Section 7, 8
