lab_meetings/journalclub2020sept/NOTES.tex
\section{Section 4}
\label{sec:org95acb9f}
\begin{frame}[label={sec:org7fd8074},plain]{Section 4: The Lyapunov equation}
We have established the covariance matrix is given by the solution to a Lyapunov equation. How do we solve it for a single equilibrium? And for a branch of equilibria?

\begin{itemize}
\item Solution methods are well-studied within control theory
\begin{itemize}
\item We can re-write the Lyapunov equation into a simple linear system of form Ax=b, and guarantee A is invertible
\item This means the system is definitely solvable, but perhaps there's a more computationally efficient way of approaching this than entirely restructuring the equation
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item The continuation consideration adds several new aspects to the problem
\begin{itemize}
\item We have access to the deterministic system Jacobian, as a result of the predictor-corrector steps of the continuation algorithm; this gives us one of the two necessary matrices
\item The other matrix can be found using at most one matrix multiplication; for additive noise, it can be precomputed without any preexisting knowledge
\item Since we're using the solution within parameter continuation, the covariance matrix at one parameter value is an excellent guess for the covariance matrix at another nearby parameter value. As such, we have excellent initial guesses for any iterative methods
\end{itemize}
\end{itemize}

\vfill
\begin{itemize}
\item Covariance computation is actually fairly straightforward, with several methods available
\begin{itemize}
\item A good initial choice means iterative methods are an obvious choice
\item Gauss-Seidel algo is a good choice, for when the system is cast into Ax=b form
\item Smith's algorithm gives us an iterative method to solve the original Lyapunov equation, without having to restructure it into Ax=b form, but does not use the initial guess, so it might be slower
\item There's also a direct method -- the Bartels-Stewart algo -- for solving the Lyapunov equation without iterations; this is useful to get the solution at the first continuation point, which can then be used as the initial guess for subsequent iterations
\item Section 7 compares the algos; the iteration is fastest for weak to medium convergence tolerances
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgd49a2e5},plain]{Noise structure and degenerate ellipsoids}
\begin{itemize}
\item If the covariance matrix is noninvertible, we can't define ellipsoids
\end{itemize}
\vfill
\begin{itemize}
\item This can happen for certain system and noise structures
\begin{itemize}
\item Say we have an uncoupled linearisation; each state variable evolves independently of the others, in the linearisation
\item If noise only acts on some state variables, there'll be some evolving stochastically, and some deterministically
\item In this case, the ellipsoid becomes ill-defined
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Define density neighbourhood over the stochastic variables only
\begin{itemize}
\item Replace deterministic variables with their equilibrium value
\item Place the standard ellipsoid ball over the stochastic subset
\item Ellipsoid becomes well-defined again
\end{itemize}
\end{itemize}
\end{frame}
\section{Section 5}
\label{sec:orge09654f}
\begin{frame}[label={sec:orgc06a7d5},plain]{Problem 3: Ellipsoids and test functions}
\begin{itemize}
\item Distance between two ellipsoids indicates the timescale of their stochastic transitions; how do we compute it?
\begin{itemize}
\item It's a useful problem in robotics, satellite control, computational geometry, etc.
\item Lots of different methods have been proposed as a result
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item We choose a distance measure that doubles up as a test function
\begin{itemize}
\item Test functions are just some equation that we plug data into, and it interprets the data for us
\item If the distance measure is >0, the ellipsoids are disjoint
\item Distance measure = 0 means ellipsoids just touch, at a point
\item Distance measure <0 means ellipsoids intersect
\item This allows us to test for dynamical switching at some timescale
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item The distance is given by the solution to an optimization problem
\begin{itemize}
\item I don't particularly understand the optimization step
\item Efficient algorithms are (apparently) available to solve it, and the paper outlines the key equations required to use them
\item As previously, we can use the previous step's solution as a good initial guess for the optimization procedure
\end{itemize}
\end{itemize}
\end{frame}
\section{Section 6}
\label{sec:org91f915d}
\begin{frame}[label={sec:org2e4b7d3},plain]{Algorithm summary}
Initialization step; for each equilibrium\ldots{}
\vfill
\begin{itemize}
\item Find a stable equilibrium of the deterministic component of the system
\begin{itemize}
\item This is a standard problem. Could either solve though integration, or Newton's method
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Compute the linearisation of the deterministic system at that equilibrium
\begin{itemize}
\item Basically just change the variables so that the equilibrium is at the origin, then take the Jacobian
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Set up the Lyapunov equation for covariances, and solve using Bartels-Stewart algorithm
\begin{itemize}
\item This is the algo of choice as it doesn't require any initial guess
\end{itemize}
\end{itemize}


\vfill
This gives us both an equilibrium to start the continuation from, and a covariance matrix which we can then re-use as an initial guess for subsequent solvings of the Lyapunov equation

The next step is to continue the equilibrium and covariance matrix under changes in a parameter
\end{frame}

\begin{frame}[label={sec:org3830811},plain]{Algorithm summary}
Iteratively\ldots{}
\begin{itemize}
\item Take a predictor-corrector step, solving deterministic continuation equations at a new parameter value
\begin{itemize}
\item This is the same as with standard continuation; predict the next solution value (equilibrium point + regularisation terms), then refine the prediction using root finding methods
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Iteratively solve the Lyapunov equation
\begin{itemize}
\item Construct the Lyapunov equation for the current covariance matrix
\item Use the previous solution as an initial guess
\item Solve it iteratively, to get the current linearised covariance
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Construct a high-density ball, for some chosen confidence level
\begin{itemize}
\item An ellipsoid whose shape is given by the covariance matrix, and size is given by the confidence level; will be smaller in directions with lower variance, larger in directions with higher variance
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Solve an optimization problem for the distances between each pair of balls
\begin{itemize}
\item Use the distance between balls at the previous step as the initial guess for the current step
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orge03438d},plain]{Outputs}
\begin{itemize}
\item Deterministic equilibria
\begin{itemize}
\item These are the standard equilibria that the system would settle to, if it weren't for random effects
\item Obtained by applying standard numerical continuation algorithms to the deterministic component
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Ellipsoids
\begin{itemize}
\item These are the confidence balls around each equilibrium
\item They show where the sample path will very probably lie
\item They're basically the stochastic version of an equilibrium
\end{itemize}
\end{itemize}
\vfill
\begin{itemize}
\item Mutual distances
\begin{itemize}
\item The distance between pairs of ellipsoids
\item These give an estimate of the rate of stochastic transition between pairs of metastable equilibria
\item Big distances mean transitions are rare
\item Small distances mean transitions are more frequent
\item Zero or negative distance means transitions are very common
\end{itemize}
\end{itemize}
\end{frame}
