lab_meetings/journalclub2020sept/NOTES.org
** Example results
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Red, blue lines are stable equilibria of the deterministic system
   * Red, blue circles are the high-confidence neighbourhoods, within which we expect the sample paths to lie
   * Green line is an unstable saddle
   * Fig b shows distance between ellipsoids; fig c shows mean stochastic transition rate; b predicts c very well
   * Fig d squashes the main fig onto a plane
   * Fig e,f are simulations of the system at the shown parameter value
     
** Example results
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

   * Shown here are the dynamics of a predator prey model
   * The dynamics are complex, as the noise follows a correlated, multiplicative format
   * The deterministic system also undergoes Hopf bifurcation
   * The continuation algo still shows up useful results
   * The ellipsoids touch the coordinate axis; if a trajectory reached here, a species would go extinct
   * This stochastic justification is used to overcome a paradox in population models, whereby they cease to settle to an equilibrium when resources are sufficiently abundant
     * Justification is that stochastic effects mean a species would go extinct before that ever happened
* Section 9
** Closing remark: a special case
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Ellipsoid separation is only a local heuristic for stochastic timescales
     * Local heuristic: the balls are defined from a linearisation around the equilibrium
     * The linear dynamics are only locally meaningful
     * Outside that locality, they might give us a heuristic description of the behaviours, but we can't read into it any more than that
   * What if we could incorporate global information into the continuation?
     * How about instead of a local heuristic, we look for something more robust?
   * Eyring-Kramer's law gives analytical switching rates in special cases
       * This relies on Jacobian computation
       * Jacobians are available from the predictor corrector step
       * We can therefore tag on the Eyring-Kramer's formula to get some additional information, that encompasses global dynamics
       * This is only available in the special case of a bistable gradient system
