lab_meetings/journalclub2020sept/NOTES.tex

\section{Section 7, 8}
\label{sec:org8fd8487}
\begin{frame}[label={sec:orgf6a3ecc},plain]{Example results}
\begin{itemize}
\item Red, blue lines are stable equilibria of the deterministic system
\item Red, blue circles are the high-confidence neighbourhoods, within which we expect the sample paths to lie
\item Green line is an unstable saddle
\item Fig b shows distance between ellipsoids; fig c shows mean stochastic transition rate; b predicts c very well
\item Fig d squashes the main fig onto a plane
\item Fig e,f are simulations of the system at the shown parameter value
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org431123f},plain]{Example results}
\begin{itemize}
\item Shown here are the dynamics of a predator prey model
\item The dynamics are complex, as the noise follows a correlated, multiplicative format
\item The deterministic system also undergoes Hopf bifurcation
\item The continuation algo still shows up useful results
\item The ellipsoids touch the coordinate axis; if a trajectory reached here, a species would go extinct
\item This stochastic justification is used to overcome a paradox in population models, whereby they cease to settle to an equilibrium when resources are sufficiently abundant
\begin{itemize}
\item Justification is that stochastic effects mean a species would go extinct before that ever happened
\end{itemize}
\end{itemize}
\end{frame}
\section{Section 9}
\label{sec:org950e8c8}
\begin{frame}[label={sec:org5d62146},plain]{Closing remark: a special case}
\begin{itemize}
\item Ellipsoid separation is only a local heuristic for stochastic timescales
\begin{itemize}
\item Local heuristic: the balls are defined from a linearisation around the equilibrium
\item The linear dynamics are only locally meaningful
\item Outside that locality, they might give us a heuristic description of the behaviours, but we can't read into it any more than that
\end{itemize}
\item What if we could incorporate global information into the continuation?
\begin{itemize}
\item How about instead of a local heuristic, we look for something more robust?
\end{itemize}
\item Eyring-Kramer's law gives analytical switching rates in special cases
\begin{itemize}
\item This relies on Jacobian computation
\item Jacobians are available from the predictor corrector step
\item We can therefore tag on the Eyring-Kramer's formula to get some additional information, that encompasses global dynamics
\item This is only available in the special case of a bistable gradient system
\end{itemize}
\end{itemize}
\end{frame}
\end{document}
